; domain
(define (domain joint_car-assistance1_domain)
(:requirements :typing :action-costs)

(:types
    place car - object
)

(:constants
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (adj-walk ?s1 - place ?s2 -  place)
    (adj-car ?s1 - place ?s2 -  place)
    (at-supporter ?s -  place)
    (at-car ?car - car ?s -  place)
    (supporter-inside ?car -  car)
    (free ?car -  car)
    (at-prime ?s -  place)
    (prime-inside ?car -  car)
)

(:functions
    (total-cost) - number
)

(:action sup_walk-supporter
    :parameters (?from - place ?to - place)
    :precondition (and
        (supporter_turn)
        (adj-walk ?from ?to)
        (at-supporter ?from)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-supporter ?to)
        (not (at-supporter ?from))
        (increase (total-cost) 1.0)
    )
)

(:action sup_get-into-car-supporter
    :parameters (?position - place ?car - car)
    :precondition (and
        (supporter_turn)
        (at-supporter ?position)
        (at-car ?car ?position)
        (free ?car)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (supporter-inside ?car)
        (not (at-supporter ?position))
        (not (free ?car))
        (increase (total-cost) 1.0)
    )
)

(:action sup_get-out-car-supporter
    :parameters (?position - place ?car - car)
    :precondition (and
        (supporter_turn)
        (supporter-inside ?car)
        (at-car ?car ?position)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-supporter ?position)
        (free ?car)
        (not (supporter-inside ?car))
        (increase (total-cost) 1.0)
    )
)

(:action sup_drive-supporter
    :parameters (?from - place ?to - place ?car - car)
    :precondition (and
        (supporter_turn)
        (adj-car ?from ?to)
        (at-car ?car ?from)
        (supporter-inside ?car)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-car ?car ?to)
        (not (at-car ?car ?from))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk-prime
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_get-into-car-prime
    :parameters (?position - place ?car - car)
    :precondition (and
        (prime_turn)
        (at-prime ?position)
        (at-car ?car ?position)
        (free ?car)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (prime-inside ?car)
        (not (at-prime ?position))
        (not (free ?car))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_get-out-car-prime
    :parameters (?position - place ?car - car)
    :precondition (and
        (prime_turn)
        (prime-inside ?car)
        (at-car ?car ?position)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?position)
        (free ?car)
        (not (prime-inside ?car))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_drive-prime
    :parameters (?from - place ?to - place ?car - car)
    :precondition (and
        (prime_turn)
        (adj-car ?from ?to)
        (at-car ?car ?from)
        (prime-inside ?car)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-car ?car ?to)
        (not (at-car ?car ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_car-assistance1_problem_4)
(:domain joint_car-assistance1_domain)
(:objects
    pos0-2 pos0-3 pos0-5 pos0-7 pos0-8 pos0-9 pos0-10 pos1-0 pos1-3 pos1-5 pos1-6 pos1-7 pos1-8 pos1-9 pos1-11 pos1-12 pos1-13 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos2-12 pos2-13 pos3-0 pos3-2 pos3-4 pos3-5 pos3-6 pos3-8 pos3-9 pos3-10 pos3-12 pos4-0 pos4-1 pos4-2 pos4-4 pos4-5 pos4-6 pos4-7 pos4-8 pos4-9 pos4-11 pos4-13 pos5-0 pos5-1 pos5-2 pos5-3 pos5-4 pos5-6 pos5-7 pos5-8 pos5-9 pos5-10 pos5-11 pos5-12 - place
    car0 - car
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (adj-walk pos0-2 pos0-3)
    (adj-walk pos0-3 pos0-2)
    (adj-car pos0-2 pos0-3)
    (adj-car pos0-3 pos0-2)
    (adj-walk pos0-3 pos1-3)
    (adj-walk pos1-3 pos0-3)
    (adj-car pos0-3 pos1-3)
    (adj-car pos1-3 pos0-3)
    (adj-car pos0-3 pos2-3)
    (adj-car pos2-3 pos0-3)
    (adj-walk pos0-5 pos1-5)
    (adj-walk pos1-5 pos0-5)
    (adj-car pos0-5 pos1-5)
    (adj-car pos1-5 pos0-5)
    (adj-car pos0-5 pos2-5)
    (adj-car pos2-5 pos0-5)
    (adj-car pos0-5 pos3-5)
    (adj-car pos3-5 pos0-5)
    (adj-walk pos0-7 pos0-8)
    (adj-walk pos0-8 pos0-7)
    (adj-walk pos0-7 pos1-7)
    (adj-walk pos1-7 pos0-7)
    (adj-car pos0-7 pos0-8)
    (adj-car pos0-8 pos0-7)
    (adj-car pos0-7 pos0-9)
    (adj-car pos0-9 pos0-7)
    (adj-car pos0-7 pos0-10)
    (adj-car pos0-10 pos0-7)
    (adj-car pos0-7 pos1-7)
    (adj-car pos1-7 pos0-7)
    (adj-walk pos0-8 pos0-9)
    (adj-walk pos0-9 pos0-8)
    (adj-walk pos0-8 pos1-8)
    (adj-walk pos1-8 pos0-8)
    (adj-car pos0-8 pos0-9)
    (adj-car pos0-9 pos0-8)
    (adj-car pos0-8 pos0-10)
    (adj-car pos0-10 pos0-8)
    (adj-car pos0-8 pos1-8)
    (adj-car pos1-8 pos0-8)
    (adj-walk pos0-9 pos0-10)
    (adj-walk pos0-10 pos0-9)
    (adj-walk pos0-9 pos1-9)
    (adj-walk pos1-9 pos0-9)
    (adj-car pos0-9 pos0-10)
    (adj-car pos0-10 pos0-9)
    (adj-car pos0-9 pos1-9)
    (adj-car pos1-9 pos0-9)
    (adj-walk pos1-3 pos2-3)
    (adj-walk pos2-3 pos1-3)
    (adj-car pos1-3 pos2-3)
    (adj-car pos2-3 pos1-3)
    (adj-walk pos1-5 pos1-6)
    (adj-walk pos1-6 pos1-5)
    (adj-walk pos1-5 pos2-5)
    (adj-walk pos2-5 pos1-5)
    (adj-car pos1-5 pos1-6)
    (adj-car pos1-6 pos1-5)
    (adj-car pos1-5 pos1-7)
    (adj-car pos1-7 pos1-5)
    (adj-car pos1-5 pos1-8)
    (adj-car pos1-8 pos1-5)
    (adj-car pos1-5 pos2-5)
    (adj-car pos2-5 pos1-5)
    (adj-car pos1-5 pos3-5)
    (adj-car pos3-5 pos1-5)
    (adj-car pos1-5 pos4-5)
    (adj-car pos4-5 pos1-5)
    (adj-walk pos1-6 pos1-7)
    (adj-walk pos1-7 pos1-6)
    (adj-car pos1-6 pos1-7)
    (adj-car pos1-7 pos1-6)
    (adj-car pos1-6 pos1-8)
    (adj-car pos1-8 pos1-6)
    (adj-car pos1-6 pos1-9)
    (adj-car pos1-9 pos1-6)
    (adj-walk pos1-7 pos1-8)
    (adj-walk pos1-8 pos1-7)
    (adj-car pos1-7 pos1-8)
    (adj-car pos1-8 pos1-7)
    (adj-car pos1-7 pos1-9)
    (adj-car pos1-9 pos1-7)
    (adj-walk pos1-8 pos1-9)
    (adj-walk pos1-9 pos1-8)
    (adj-car pos1-8 pos1-9)
    (adj-car pos1-9 pos1-8)
    (adj-walk pos1-11 pos1-12)
    (adj-walk pos1-12 pos1-11)
    (adj-car pos1-11 pos1-12)
    (adj-car pos1-12 pos1-11)
    (adj-car pos1-11 pos1-13)
    (adj-car pos1-13 pos1-11)
    (adj-walk pos1-12 pos1-13)
    (adj-walk pos1-13 pos1-12)
    (adj-walk pos1-12 pos2-12)
    (adj-walk pos2-12 pos1-12)
    (adj-car pos1-12 pos1-13)
    (adj-car pos1-13 pos1-12)
    (adj-car pos1-12 pos2-12)
    (adj-car pos2-12 pos1-12)
    (adj-car pos1-12 pos3-12)
    (adj-car pos3-12 pos1-12)
    (adj-walk pos1-13 pos2-13)
    (adj-walk pos2-13 pos1-13)
    (adj-car pos1-13 pos2-13)
    (adj-car pos2-13 pos1-13)
    (adj-walk pos2-1 pos2-2)
    (adj-walk pos2-2 pos2-1)
    (adj-car pos2-1 pos2-2)
    (adj-car pos2-2 pos2-1)
    (adj-car pos2-1 pos2-3)
    (adj-car pos2-3 pos2-1)
    (adj-car pos2-1 pos2-4)
    (adj-car pos2-4 pos2-1)
    (adj-walk pos2-2 pos2-3)
    (adj-walk pos2-3 pos2-2)
    (adj-walk pos2-2 pos3-2)
    (adj-walk pos3-2 pos2-2)
    (adj-car pos2-2 pos2-3)
    (adj-car pos2-3 pos2-2)
    (adj-car pos2-2 pos2-4)
    (adj-car pos2-4 pos2-2)
    (adj-car pos2-2 pos2-5)
    (adj-car pos2-5 pos2-2)
    (adj-car pos2-2 pos3-2)
    (adj-car pos3-2 pos2-2)
    (adj-car pos2-2 pos4-2)
    (adj-car pos4-2 pos2-2)
    (adj-car pos2-2 pos5-2)
    (adj-car pos5-2 pos2-2)
    (adj-walk pos2-3 pos2-4)
    (adj-walk pos2-4 pos2-3)
    (adj-car pos2-3 pos2-4)
    (adj-car pos2-4 pos2-3)
    (adj-car pos2-3 pos2-5)
    (adj-car pos2-5 pos2-3)
    (adj-walk pos2-4 pos2-5)
    (adj-walk pos2-5 pos2-4)
    (adj-walk pos2-4 pos3-4)
    (adj-walk pos3-4 pos2-4)
    (adj-car pos2-4 pos2-5)
    (adj-car pos2-5 pos2-4)
    (adj-car pos2-4 pos3-4)
    (adj-car pos3-4 pos2-4)
    (adj-car pos2-4 pos4-4)
    (adj-car pos4-4 pos2-4)
    (adj-car pos2-4 pos5-4)
    (adj-car pos5-4 pos2-4)
    (adj-walk pos2-5 pos3-5)
    (adj-walk pos3-5 pos2-5)
    (adj-car pos2-5 pos3-5)
    (adj-car pos3-5 pos2-5)
    (adj-car pos2-5 pos4-5)
    (adj-car pos4-5 pos2-5)
    (adj-walk pos2-12 pos2-13)
    (adj-walk pos2-13 pos2-12)
    (adj-walk pos2-12 pos3-12)
    (adj-walk pos3-12 pos2-12)
    (adj-car pos2-12 pos2-13)
    (adj-car pos2-13 pos2-12)
    (adj-car pos2-12 pos3-12)
    (adj-car pos3-12 pos2-12)
    (adj-walk pos3-0 pos4-0)
    (adj-walk pos4-0 pos3-0)
    (adj-car pos3-0 pos4-0)
    (adj-car pos4-0 pos3-0)
    (adj-car pos3-0 pos5-0)
    (adj-car pos5-0 pos3-0)
    (adj-walk pos3-2 pos4-2)
    (adj-walk pos4-2 pos3-2)
    (adj-car pos3-2 pos4-2)
    (adj-car pos4-2 pos3-2)
    (adj-car pos3-2 pos5-2)
    (adj-car pos5-2 pos3-2)
    (adj-walk pos3-4 pos3-5)
    (adj-walk pos3-5 pos3-4)
    (adj-walk pos3-4 pos4-4)
    (adj-walk pos4-4 pos3-4)
    (adj-car pos3-4 pos3-5)
    (adj-car pos3-5 pos3-4)
    (adj-car pos3-4 pos3-6)
    (adj-car pos3-6 pos3-4)
    (adj-car pos3-4 pos4-4)
    (adj-car pos4-4 pos3-4)
    (adj-car pos3-4 pos5-4)
    (adj-car pos5-4 pos3-4)
    (adj-walk pos3-5 pos3-6)
    (adj-walk pos3-6 pos3-5)
    (adj-walk pos3-5 pos4-5)
    (adj-walk pos4-5 pos3-5)
    (adj-car pos3-5 pos3-6)
    (adj-car pos3-6 pos3-5)
    (adj-car pos3-5 pos4-5)
    (adj-car pos4-5 pos3-5)
    (adj-walk pos3-6 pos4-6)
    (adj-walk pos4-6 pos3-6)
    (adj-car pos3-6 pos4-6)
    (adj-car pos4-6 pos3-6)
    (adj-car pos3-6 pos5-6)
    (adj-car pos5-6 pos3-6)
    (adj-walk pos3-8 pos3-9)
    (adj-walk pos3-9 pos3-8)
    (adj-walk pos3-8 pos4-8)
    (adj-walk pos4-8 pos3-8)
    (adj-car pos3-8 pos3-9)
    (adj-car pos3-9 pos3-8)
    (adj-car pos3-8 pos3-10)
    (adj-car pos3-10 pos3-8)
    (adj-car pos3-8 pos4-8)
    (adj-car pos4-8 pos3-8)
    (adj-car pos3-8 pos5-8)
    (adj-car pos5-8 pos3-8)
    (adj-walk pos3-9 pos3-10)
    (adj-walk pos3-10 pos3-9)
    (adj-walk pos3-9 pos4-9)
    (adj-walk pos4-9 pos3-9)
    (adj-car pos3-9 pos3-10)
    (adj-car pos3-10 pos3-9)
    (adj-car pos3-9 pos4-9)
    (adj-car pos4-9 pos3-9)
    (adj-car pos3-9 pos5-9)
    (adj-car pos5-9 pos3-9)
    (adj-walk pos4-0 pos4-1)
    (adj-walk pos4-1 pos4-0)
    (adj-walk pos4-0 pos5-0)
    (adj-walk pos5-0 pos4-0)
    (adj-car pos4-0 pos4-1)
    (adj-car pos4-1 pos4-0)
    (adj-car pos4-0 pos4-2)
    (adj-car pos4-2 pos4-0)
    (adj-car pos4-0 pos5-0)
    (adj-car pos5-0 pos4-0)
    (adj-walk pos4-1 pos4-2)
    (adj-walk pos4-2 pos4-1)
    (adj-walk pos4-1 pos5-1)
    (adj-walk pos5-1 pos4-1)
    (adj-car pos4-1 pos4-2)
    (adj-car pos4-2 pos4-1)
    (adj-car pos4-1 pos5-1)
    (adj-car pos5-1 pos4-1)
    (adj-walk pos4-2 pos5-2)
    (adj-walk pos5-2 pos4-2)
    (adj-car pos4-2 pos5-2)
    (adj-car pos5-2 pos4-2)
    (adj-walk pos4-4 pos4-5)
    (adj-walk pos4-5 pos4-4)
    (adj-walk pos4-4 pos5-4)
    (adj-walk pos5-4 pos4-4)
    (adj-car pos4-4 pos4-5)
    (adj-car pos4-5 pos4-4)
    (adj-car pos4-4 pos4-6)
    (adj-car pos4-6 pos4-4)
    (adj-car pos4-4 pos4-7)
    (adj-car pos4-7 pos4-4)
    (adj-car pos4-4 pos5-4)
    (adj-car pos5-4 pos4-4)
    (adj-walk pos4-5 pos4-6)
    (adj-walk pos4-6 pos4-5)
    (adj-car pos4-5 pos4-6)
    (adj-car pos4-6 pos4-5)
    (adj-car pos4-5 pos4-7)
    (adj-car pos4-7 pos4-5)
    (adj-car pos4-5 pos4-8)
    (adj-car pos4-8 pos4-5)
    (adj-walk pos4-6 pos4-7)
    (adj-walk pos4-7 pos4-6)
    (adj-walk pos4-6 pos5-6)
    (adj-walk pos5-6 pos4-6)
    (adj-car pos4-6 pos4-7)
    (adj-car pos4-7 pos4-6)
    (adj-car pos4-6 pos4-8)
    (adj-car pos4-8 pos4-6)
    (adj-car pos4-6 pos4-9)
    (adj-car pos4-9 pos4-6)
    (adj-car pos4-6 pos5-6)
    (adj-car pos5-6 pos4-6)
    (adj-walk pos4-7 pos4-8)
    (adj-walk pos4-8 pos4-7)
    (adj-walk pos4-7 pos5-7)
    (adj-walk pos5-7 pos4-7)
    (adj-car pos4-7 pos4-8)
    (adj-car pos4-8 pos4-7)
    (adj-car pos4-7 pos4-9)
    (adj-car pos4-9 pos4-7)
    (adj-car pos4-7 pos5-7)
    (adj-car pos5-7 pos4-7)
    (adj-walk pos4-8 pos4-9)
    (adj-walk pos4-9 pos4-8)
    (adj-walk pos4-8 pos5-8)
    (adj-walk pos5-8 pos4-8)
    (adj-car pos4-8 pos4-9)
    (adj-car pos4-9 pos4-8)
    (adj-car pos4-8 pos5-8)
    (adj-car pos5-8 pos4-8)
    (adj-walk pos4-9 pos5-9)
    (adj-walk pos5-9 pos4-9)
    (adj-car pos4-9 pos5-9)
    (adj-car pos5-9 pos4-9)
    (adj-walk pos4-11 pos5-11)
    (adj-walk pos5-11 pos4-11)
    (adj-car pos4-11 pos5-11)
    (adj-car pos5-11 pos4-11)
    (adj-walk pos5-0 pos5-1)
    (adj-walk pos5-1 pos5-0)
    (adj-car pos5-0 pos5-1)
    (adj-car pos5-1 pos5-0)
    (adj-car pos5-0 pos5-2)
    (adj-car pos5-2 pos5-0)
    (adj-car pos5-0 pos5-3)
    (adj-car pos5-3 pos5-0)
    (adj-walk pos5-1 pos5-2)
    (adj-walk pos5-2 pos5-1)
    (adj-car pos5-1 pos5-2)
    (adj-car pos5-2 pos5-1)
    (adj-car pos5-1 pos5-3)
    (adj-car pos5-3 pos5-1)
    (adj-car pos5-1 pos5-4)
    (adj-car pos5-4 pos5-1)
    (adj-walk pos5-2 pos5-3)
    (adj-walk pos5-3 pos5-2)
    (adj-car pos5-2 pos5-3)
    (adj-car pos5-3 pos5-2)
    (adj-car pos5-2 pos5-4)
    (adj-car pos5-4 pos5-2)
    (adj-walk pos5-3 pos5-4)
    (adj-walk pos5-4 pos5-3)
    (adj-car pos5-3 pos5-4)
    (adj-car pos5-4 pos5-3)
    (adj-walk pos5-6 pos5-7)
    (adj-walk pos5-7 pos5-6)
    (adj-car pos5-6 pos5-7)
    (adj-car pos5-7 pos5-6)
    (adj-car pos5-6 pos5-8)
    (adj-car pos5-8 pos5-6)
    (adj-car pos5-6 pos5-9)
    (adj-car pos5-9 pos5-6)
    (adj-walk pos5-7 pos5-8)
    (adj-walk pos5-8 pos5-7)
    (adj-car pos5-7 pos5-8)
    (adj-car pos5-8 pos5-7)
    (adj-car pos5-7 pos5-9)
    (adj-car pos5-9 pos5-7)
    (adj-car pos5-7 pos5-10)
    (adj-car pos5-10 pos5-7)
    (adj-walk pos5-8 pos5-9)
    (adj-walk pos5-9 pos5-8)
    (adj-car pos5-8 pos5-9)
    (adj-car pos5-9 pos5-8)
    (adj-car pos5-8 pos5-10)
    (adj-car pos5-10 pos5-8)
    (adj-car pos5-8 pos5-11)
    (adj-car pos5-11 pos5-8)
    (adj-walk pos5-9 pos5-10)
    (adj-walk pos5-10 pos5-9)
    (adj-car pos5-9 pos5-10)
    (adj-car pos5-10 pos5-9)
    (adj-car pos5-9 pos5-11)
    (adj-car pos5-11 pos5-9)
    (adj-car pos5-9 pos5-12)
    (adj-car pos5-12 pos5-9)
    (adj-walk pos5-10 pos5-11)
    (adj-walk pos5-11 pos5-10)
    (adj-car pos5-10 pos5-11)
    (adj-car pos5-11 pos5-10)
    (adj-car pos5-10 pos5-12)
    (adj-car pos5-12 pos5-10)
    (adj-walk pos5-11 pos5-12)
    (adj-walk pos5-12 pos5-11)
    (adj-car pos5-11 pos5-12)
    (adj-car pos5-12 pos5-11)
    (at-car car0 pos3-6)
    (free car0)
    (at-supporter pos0-5)
    (at-prime pos4-11)
)

(:goal
  (and
    (at-prime pos1-7)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
2. (pri_walk-prime pos4-11 pos5-11)
   deleted: (prime_turn) (at-prime pos4-11)
   added: (supporter_turn) (at-prime pos5-11)
   goals met: 0 of 1
3. (sup_walk-supporter pos0-5 pos1-5)
   deleted: (supporter_turn) (at-supporter pos0-5)
   added: (prime_turn) (at-supporter pos1-5)
   goals met: 0 of 1
4. (pri_walk-prime pos5-11 pos5-10)
   deleted: (prime_turn) (at-prime pos5-11)
   added: (supporter_turn) (at-prime pos5-10)
   goals met: 0 of 1
5. (sup_walk-supporter pos1-5 pos2-5)
   deleted: (supporter_turn) (at-supporter pos1-5)
   added: (prime_turn) (at-supporter pos2-5)
   goals met: 0 of 1
6. (pri_walk-prime pos5-10 pos5-9)
   deleted: (prime_turn) (at-prime pos5-10)
   added: (supporter_turn) (at-prime pos5-9)
   goals met: 0 of 1
7. (sup_walk-supporter pos2-5 pos3-5)
   deleted: (supporter_turn) (at-supporter pos2-5)
   added: (prime_turn) (at-supporter pos3-5)
   goals met: 0 of 1
8. (pri_walk-prime pos5-9 pos4-9)
   deleted: (prime_turn) (at-prime pos5-9)
   added: (supporter_turn) (at-prime pos4-9)
   goals met: 0 of 1
9. (sup_walk-supporter pos3-5 pos3-6)
   deleted: (supporter_turn) (at-supporter pos3-5)
   added: (prime_turn) (at-supporter pos3-6)
   goals met: 0 of 1
10. (pri_walk-prime pos4-9 pos4-8)
   deleted: (prime_turn) (at-prime pos4-9)
   added: (supporter_turn) (at-prime pos4-8)
   goals met: 0 of 1
11. (sup_get-into-car-supporter pos3-6 car0)
   deleted: (supporter_turn) (at-supporter pos3-6) (free car0)
   added: (prime_turn) (supporter-inside car0)
   goals met: 0 of 1
12. (pri_walk-prime pos4-8 pos4-7)
   deleted: (prime_turn) (at-prime pos4-8)
   added: (supporter_turn) (at-prime pos4-7)
   goals met: 0 of 1
13. (sup_drive-supporter pos3-6 pos4-6 car0)
   deleted: (supporter_turn) (at-car car0 pos3-6)
   added: (prime_turn) (at-car car0 pos4-6)
   goals met: 0 of 1
14. (pri_walk-prime pos4-7 pos4-6)
   deleted: (prime_turn) (at-prime pos4-7)
   added: (supporter_turn) (at-prime pos4-6)
   goals met: 0 of 1
15. (sup_get-out-car-supporter pos4-6 car0)
   deleted: (supporter_turn) (supporter-inside car0)
   added: (prime_turn) (at-supporter pos4-6) (free car0)
   goals met: 0 of 1
16. (pri_get-into-car-prime pos4-6 car0)
   deleted: (prime_turn) (at-prime pos4-6) (free car0)
   added: (supporter_turn) (prime-inside car0)
   goals met: 0 of 1
17. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
18. (pri_drive-prime pos4-6 pos4-5 car0)
   deleted: (prime_turn) (at-car car0 pos4-6)
   added: (supporter_turn) (at-car car0 pos4-5)
   goals met: 0 of 1
19. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
20. (pri_drive-prime pos4-5 pos1-5 car0)
   deleted: (prime_turn) (at-car car0 pos4-5)
   added: (supporter_turn) (at-car car0 pos1-5)
   goals met: 0 of 1
21. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
22. (pri_drive-prime pos1-5 pos1-7 car0)
   deleted: (prime_turn) (at-car car0 pos1-5)
   added: (supporter_turn) (at-car car0 pos1-7)
   goals met: 0 of 1
23. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
24. (pri_get-out-car-prime pos1-7 car0)
   deleted: (prime_turn) (prime-inside car0)
   added: (supporter_turn) (at-prime pos1-7) (free car0)
   goals met: 1 of 1
